In [1]:
# 24 Feb assignment

In [2]:
# Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
pd.Categorical(df['Pclass'])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [8]:
df.iloc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [9]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
Data1 = [['Ram',25,'Agra'],['Rahul',27,'Mumbai'],['Aman',24,'Delhi'],['Sumeet',26,'Kanpur']]
df1 = pd.DataFrame(data =Data1 ,columns = ['A','B','C'])
df1

        A   B       C
0     Ram  25    Agra
1   Rahul  27  Mumbai
2    Aman  24   Delhi
3  Sumeet  26  Kanpur

In [11]:
new_index = [1,3,5]
df1.reindex(new_index)

        A     B       C
1   Rahul  27.0  Mumbai
3  Sumeet  26.0  Kanpur
5     NaN   NaN     NaN

In [12]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.

In [13]:
Data2 = [['Ram',25,'Agra',10],['Rahul',27,'Mumbai',20],['Aman',24,'Delhi',30],['Sumeet',26,'Kanpur',40],['Akash',23,'Agra',50]]
df2 = pd.DataFrame(data =Data2 ,columns = ['A','B','C','Values'])
df2

        A   B       C  Values
0     Ram  25    Agra      10
1   Rahul  27  Mumbai      20
2    Aman  24   Delhi      30
3  Sumeet  26  Kanpur      40
4   Akash  23    Agra      50

In [14]:
df2['Values']

0    10
1    20
2    30
3    40
4    50
Name: Values, dtype: int64

In [15]:
sum=0
for i in range(0,3):
    sum = sum + df2['Values'][i]

In [16]:
print(sum)

60

In [17]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.
import pandas as pd

In [18]:
Data2 = [['Ram',25,'Agra'],['Rahul',27,'Mumbai'],['Aman',24,'Delhi'],['Sumeet',26,'Kanpur'],['Akash',23,'Agra']]
df3 = pd.DataFrame(data =Data2 ,columns = ['A','B','Text'])
df3

        A   B    Text
0     Ram  25    Agra
1   Rahul  27  Mumbai
2    Aman  24   Delhi
3  Sumeet  26  Kanpur
4   Akash  23    Agra

In [19]:
df3['Text']
lis = []
for i in range(0 ,len(df3['Text'])):
    lis.append(len(df3['Text'][i]))

In [20]:
lis

[4, 6, 5, 6, 4]

In [21]:
df3['Word_count'] = lis

In [22]:
df3

        A   B    Text  Word_count
0     Ram  25    Agra           4
1   Rahul  27  Mumbai           6
2    Aman  24   Delhi           5
3  Sumeet  26  Kanpur           6
4   Akash  23    Agra           4

In [23]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [24]:
#  DataFrame.shape()
# The shape of a DataFrame is a tuple of array dimensions that tells the 
# number of rows and columns of a given DataFrame.
# DataFrame.size() is used to find the total no of elements in table.
# Returns size of dataframe/series which is equivalent to total number of elements. That is rows*columns.

In [25]:
# Q6. Which function of pandas do we use to read an excel file?

In [26]:
# file =('path_of_excel_file')
# newData = pds.read_excel(file)
# newData

In [27]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
# 'Username' in df that contains only the username part of each email address.
import pandas as pd

In [28]:
lis2 = ['akash@gmail.com','aman1211@gmail.com','john.doe@example.com','sumeet007@gmail.com']
df4 = pd.DataFrame(data = lis2,columns = ['Email'])
df4

                  Email
0       akash@gmail.com
1    aman1211@gmail.com
2  john.doe@example.com
3   sumeet007@gmail.com

In [29]:
lis3 = []
for i in range(0,len(df4['Email'])):
    lis3.append(df4['Email'][i].split('@')[0])

In [30]:
df4['Username'] = lis3
df4

                  Email   Username
0       akash@gmail.com      akash
1    aman1211@gmail.com   aman1211
2  john.doe@example.com   john.doe
3   sumeet007@gmail.com  sumeet007

In [31]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
# function should return a new DataFrame that contains only the selected rows.

In [32]:
lis4 = [[3,5,1] ,[8,2,7],[6,9,4],[2,3,5],[9,1,2]]
df4 = pd.DataFrame(data = lis4 , columns= ['A','B','C'])
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [33]:
 df4[(df4['A']>5) & (df4['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [34]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
# median, and standard deviation of the values in the 'Values' column.

In [35]:
lis5 = [1,2,3,4,5,6,7]
df5 = pd.DataFrame( data = lis5 ,columns = ['Values'])
df5

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7

In [36]:
df5.describe().head(3)

         Values
count  7.000000
mean   4.000000
std    2.160247

In [37]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
# should include the current day.
import pandas as pd

In [38]:
lis5 = [['01-02-2023',120],['02-02-2023',130],['03-02-2023',140],['04-02-2023',150],['05-02-2023',160],
        ['06-02-2023',170],['07-02-2023',180],['08-02-2023',190],['09-02-2023',200],['10-02-2023',210]]
df6 = pd.DataFrame( data=lis5 , columns=['date','Sales'])
df6

         date  Sales
0  01-02-2023    120
1  02-02-2023    130
2  03-02-2023    140
3  04-02-2023    150
4  05-02-2023    160
5  06-02-2023    170
6  07-02-2023    180
7  08-02-2023    190
8  09-02-2023    200
9  10-02-2023    210

In [39]:
# movind average
df6['Movingaverage'] = df6['Sales'].rolling(7).mean()
# df6.dropna(inplace=True)

In [40]:
df6

         date  Sales  Movingaverage
0  01-02-2023    120            NaN
1  02-02-2023    130            NaN
2  03-02-2023    140            NaN
3  04-02-2023    150            NaN
4  05-02-2023    160            NaN
5  06-02-2023    170            NaN
6  07-02-2023    180          150.0
7  08-02-2023    190          160.0
8  09-02-2023    200          170.0
9  10-02-2023    210          180.0

In [41]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
# Monday, Tuesday) corresponding to each date in the 'Date' column.

In [42]:
lis5 = [['01-02-2023'],['02-02-2023'],['03-02-2023'],['04-02-2023'],['05-02-2023'],
        ['06-02-2023'],['07-02-2023']]
df6 = pd.DataFrame( data=lis5 , columns=['date'])
df6

         date
0  01-02-2023
1  02-02-2023
2  03-02-2023
3  04-02-2023
4  05-02-2023
5  06-02-2023
6  07-02-2023

In [43]:
lis6 = []
for i in range(0,len(df6['date'])):
    date_1 = df6['date'][i] 
    lis6.append(pd.to_datetime(date_1, format ="%d-%m-%Y").day_name())

In [44]:
df6['Weekday'] = lis6
df6

         date    Weekday
0  01-02-2023  Wednesday
1  02-02-2023   Thursday
2  03-02-2023     Friday
3  04-02-2023   Saturday
4  05-02-2023     Sunday
5  06-02-2023     Monday
6  07-02-2023    Tuesday

In [45]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [46]:
lis7 = [['2023-01-01'],['2023-01-07'],['2023-01-15'],['2023-01-29'],['2023-02-01'],
        ['06-02-2023'],['07-02-2023']]
df7 = pd.DataFrame(data = lis7, columns = ['date'])
df7

         date
0  2023-01-01
1  2023-01-07
2  2023-01-15
3  2023-01-29
4  2023-02-01
5  06-02-2023
6  07-02-2023

In [47]:
x = df7[(df7['date'] >= '2023-01-01') &
       (df7['date'] <= '2023-01-31')]
x

         date
0  2023-01-01
1  2023-01-07
2  2023-01-15
3  2023-01-29

In [48]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
# be imported.

In [49]:
# pandas library need to be imported to use pandas function.